# City Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
City Members
City Class Methods Properties See Also
---
The City type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| Latitude | Latitude of the city |
| Longitude | Longitude of the city |
| Name | The name of the city |
| TimeZone | Time-zone in which the city resides |
| WeatherStation | An identifier for the nearest weather station |

# See Also
City Class
Autodesk.Revit.DB Namespace